#### Terraform Tfsec 🤖`success'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Reading...
data.aws_canonical_user_id.current: Reading...
data.aws_cloudfront_cache_policy.cache_policy_cloudfront: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_canonical_user_id.current: Read complete after 1s [id=7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_s3_bucket.demo-portal-s3-bucket will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "demo-portal-s3-bucket" {
      + arn                         = (known after apply)
      + bucket                      = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_cloudfront_distribution.this-cdn-portal will be created
  + resource "aws_cloudfront_distribution" "this-cdn-portal" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "app-name"               = "portal-cloudfront"
          + "app-role"               = "Cloudfront distribution for s3"
          + "security-accessibility" = "Public"
        }
      + tags_all                       = {
          + "app-environment"        = "Dev"
          + "app-name"               = "portal-cloudfront"
          + "app-role"               = "Cloudfront distribution for s3"
          + "info-created_by"        = "Aayush"
          + "info-purpose"           = "Development"
          + "info-terraform"         = "yes"
          + "org"                    = "CAW Studios"
          + "org-cost-center"        = "CAW Studios"
          + "org-owner"              = "aayushbajaj505@gmail.com"
          + "org-team"               = "devops"
          + "security-accessibility" = "Public"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_s3_bucket.this-s3-bucket will be created
  + resource "aws_s3_bucket" "this-s3-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "app-name"               = "demo-bucket-aayush-S3-Bucket"
          + "app-role"               = "s3 Bucket"
          + "security-accessibility" = "Private"
        }
      + tags_all                    = {
          + "app-environment"        = "Dev"
          + "app-name"               = "demo-bucket-aayush-S3-Bucket"
          + "app-role"               = "s3 Bucket"
          + "info-created_by"        = "Aayush"
          + "info-purpose"           = "Development"
          + "info-terraform"         = "yes"
          + "org"                    = "CAW Studios"
          + "org-cost-center"        = "CAW Studios"
          + "org-owner"              = "aayushbajaj505@gmail.com"
          + "org-team"               = "devops"
          + "security-accessibility" = "Private"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.this-s3-acl_policy will be created
  + resource "aws_s3_bucket_acl" "this-s3-acl_policy" {
      + bucket = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = "READ"

              + grantee {
                  + display_name = (known after apply)
                  + type         = "Group"
                  + uri          = "http://acs.amazonaws.com/groups/global/AllUsers"
                }
            }
          + grant {
              + permission = "READ_ACP"

              + grantee {
                  + display_name = (known after apply)
                  + type         = "Group"
                  + uri          = "http://acs.amazonaws.com/groups/global/AllUsers"
                }
            }
          + grant {
              + permission = "READ"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00"
                  + type         = "CanonicalUser"
                }
            }
          + grant {
              + permission = "READ_ACP"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00"
                  + type         = "CanonicalUser"
                }
            }
          + grant {
              + permission = "WRITE"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00"
                  + type         = "CanonicalUser"
                }
            }
          + grant {
              + permission = "WRITE_ACP"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00"
                  + type         = "CanonicalUser"
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = "7b24440f1a114a6facb2373de7b91fc2957ca21eb08c8a1f618f6529fd5a9a00"
            }
        }
    }

  # aws_s3_bucket_policy.this-s3-policy will be created
  + resource "aws_s3_bucket_policy" "this-s3-policy" {
      + bucket = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "PolicyForCloudFrontPrivateContent"
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush/*"
                      + Sid       = "AddPerm"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
    }

  # aws_s3_bucket_website_configuration.this-s3-website-configuration will be created
  + resource "aws_s3_bucket_website_configuration" "this-s3-website-configuration" {
      + bucket           = "caw-aws-aps1-prod-s3-terraform-demo-demo-bucket-aayush"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @AayushbajajCAW, Action: `pull_request`, Working Directory: ``, Workflow: `Plan using Terraform`*